03장 pandas 기본

Dataframe 객체 : 2차원 배열
Series 객체 : 1차원 배열, 1차원 ndarray 와 호환

In [2]:
import pandas as pd
# from pandas.io.parser import read_csv  이것도 가능하다
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
print(df)
# 컬럼네임, 인덱스 네임

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [73]:
score_table = {'이름' : ['a','b','c','d','e'],
              '국어점수' : [50,60,70,80,90],
              '영어점수' : [10,20,30,40,50],
              '수학점수' : [20,30,40,10,30]}
df = pd.DataFrame(score_table)
print(df)
df       # 그냥 df가 더 깔끔하게 나온다

  이름  국어점수  영어점수  수학점수
0  a    50    10    20
1  b    60    20    30
2  c    70    30    40
3  d    80    40    10
4  e    90    50    30

  이름  국어점수  영어점수  수학점수
0  a    50    10    20
1  b    60    20    30
2  c    70    30    40
3  d    80    40    10
4  e    90    50    30

In [13]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [16]:
df.columns

Index(['이름', '국어점수', '영어점수', '수학점수'], dtype='object')

In [17]:
df.values

array([['a', 50, 10, 20],
       ['b', 60, 20, 30],
       ['c', 70, 30, 40],
       ['d', 80, 40, 10],
       ['e', 90, 50, 30]], dtype=object)

pandas로 csv 파일 읽어 오기
 - pd.read_csv('파일명') 
 - df.to_csv('파일명')

In [40]:
df = pd.read_csv('WHO_first9cols.csv')
# df

In [31]:
# 교재에 없는 저장 방법('이름 설정')
df.to_csv('세계보건기구9개의컬럼.csv',index=False)

 - pandas. 은 불러오기
 - df. 은 저장(인덱스 포함 저장. index=False라고 적어주면 없어진다)

데이터 프레임 분석 : 속성  _ 2차원이 대부분

In [39]:
print('shape:',df.shape)
print('len:', len(df))               # 행의 갯수를 출력
print('header:', df.columns)         # ★중요
df.columns[0]                        # 원하는 정보 인덱싱이 가능

print('index:', df.index)            # 행의 인덱스 값
print('values:',df.values)

shape: (202, 9)
len: 202
header: Index(['Country', 'CountryID', 'Continent', 'Adolescent fertility rate (%)',
       'Adult literacy rate (%)',
       'Gross national income per capita (PPP international $)',
       'Net primary school enrolment ratio female (%)',
       'Net primary school enrolment ratio male (%)',
       'Population (in thousands) total'],
      dtype='object')
index: RangeIndex(start=0, stop=202, step=1)
values: [['Afghanistan' 1 1 ... nan nan 26088.0]
 ['Albania' 2 2 ... 93.0 94.0 3172.0]
 ['Algeria' 3 3 ... 94.0 96.0 33351.0]
 ...
 ['Yemen' 200 1 ... 65.0 85.0 21732.0]
 ['Zambia' 201 3 ... 94.0 90.0 11696.0]
 ['Zimbabwe' 202 3 ... 88.0 87.0 13228.0]]

Dataframe을 행(row)으로 접근

In [71]:
# df[start 행번호 :end 행번호 :step]
df[:1]
df[11:16]
df[::3]     # 3개씩 step
df[::-1]    # 역순으로 출력
# 슬라이싱처럼 사용
df[:1]

,Country,CountryID,Continent,Adolescent fertility rate (%),Adult literacy rate (%),Gross national income per capita (PPP international $),Net primary school enrolment ratio female (%),Net primary school enrolment ratio male (%),Population (in thousands) total
0,Afghanistan,1,1,151.0,28.0,NaN,NaN,NaN,26088.0

Dataframe을 열(colunms)으로 접근

In [70]:
# len(df.columns)     # 9개의 열 
# df['Country']       # 컬럼 네임을 집어 넣으면 값이 나온다
# df[df.columns[0]]   # 같은 결과
# df[df.columns[-1]]
# print(df[df.columns[-1]])

Series 객체 : 1차원 배열, DataFrame내의 1개의 컬럼

In [57]:
type(df)                # pandas.core.frame.DataFrame
sr = df['Country']
type(sr)                # pandas.core.series.Series
sr = df[df.columns[0]]
type(sr)                # pandas.core.series.Series

'Afghanistan'

In [67]:
sr = df[df.columns[0]][0]
sr                           # 'Afghanistan'
sr = df[df.columns[0]][:4]
sr 
sr = df[df.columns[0]][-1:] 
sr                           # 201    Zimbabwe, 마지막 요소 접근
sr = df[df.columns[0]][::-1] 
sr                           # 거꾸로~ㅎ
sr = df[df.columns[0]][0]
sr

'Afghanistan'

In [78]:
r = df[['Country','CountryID','Continent']]
# 요런 것도 가능, 대괄호 두번 치면 원하는 컬럼만 뽑는다.
# 컬럼 하나만 추출하면 시리즈, 두 개 이상이면 데이터프레임
type(r)   #  pandas.core.frame.DataFrame

pandas.core.frame.DataFrame

In [81]:
r = df[[df.columns[0],df.columns[1],df.columns[2]]]
r
type(r)
# 요렇게도 가능. 위랑 똑같은 결과

pandas.core.frame.DataFrame

In [82]:
r2 = df[[df.columns[0],df.columns[1],df.columns[2]]][:10]
r2
# 10개만 보고 싶다. 샘플링 가능

               Country  CountryID  Continent
0          Afghanistan          1          1
1              Albania          2          2
2              Algeria          3          3
3              Andorra          4          2
4               Angola          5          3
5  Antigua and Barbuda          6          4
6            Argentina          7          5
7              Armenia          8          2
8            Australia          9          6
9              Austria         10          2

DataFrame의 스칼라 값(원소) 접근하기 : 읽기 및 수정

- (1) df.loc[행,열] : 명시적인 index
- (2) df.iloc[행,열] : 암묵적인 index(파이썬 스타일), int형 사용, 0부터 시작

In [90]:
df.loc[78,'Country']         # 하나만 가능
df.loc[:3,'Country']         # 범위 지정 가능
df.loc[:3,['Country','CountryID', 'Continent']]   # 열도 범위 지정 가능

       Country  CountryID  Continent
0  Afghanistan          1          1
1      Albania          2          2
2      Algeria          3          3
3      Andorra          4          2

In [100]:
# df.iloc[]

data = df.iloc[0,0]
print(data, type(data))
# Afghanistan <class 'str'>

data = df.iloc[2,2]
print(data, type(data))
# 3 <class 'numpy.int64'>

data = df.iloc[2,[0,1,2]]
print(data, type(data))
# <class 'pandas.core.series.Series'>

data = df.iloc[:3,[0,1,2]]
print(data, type(data))
# <class 'pandas.core.frame.DataFrame'>

df.iloc[3,0] = 'jae kwang'    # 스칼라값 변경(메모리 값이 바뀐 것이지 원본이 바뀐 것으 아니다.)
data = df.iloc[3,0]
print(data)

df.iloc[-1,0]           # 마지막을 추출하기
df.iloc[0,-1]

Afghanistan <class 'str'>
3 <class 'numpy.int64'>
Country      Algeria
CountryID          3
Continent          3
Name: 2, dtype: object <class 'pandas.core.series.Series'>
       Country  CountryID  Continent
0  Afghanistan          1          1
1      Albania          2          2
2      Algeria          3          3 <class 'pandas.core.frame.DataFrame'>
jae kwang

# 태양 흑점 (sunspot) 데이터

Quandl 패키지 설치 방법
 - window 메뉴에서 'Anaconda Prompt'를 관리자 권한으로 실행하고 
 - 명령창에서 conda install quandl 실행

In [3]:
import quandl
sunspots = quandl.get('SIDC/SUNSPOTS_A')

In [118]:
type(sunspots)

pandas.core.frame.DataFrame

In [4]:
sunspots.to_csv('sunspots.csv',float_format = '%.2f',na_rep='NaN')

In [129]:
sunspots = pd.read_csv('sunspots.csv')
sunspots.shape       # (319, 5)
sunspots.iloc[[2,4,-4,-2]]      # 열을 선택안해서 다 선택하는 것으로 행으로만 접근.

,Date,Yearly Mean Total Sunspot Number,Yearly Mean Standard Deviation,Number of Observations,Definitive/Provisional Indicator
2,1702-12-31,26.7,NaN,NaN,1.0
4,1704-12-31,60.0,NaN,NaN,1.0
315,2015-12-31,69.8,6.4,8903.0,1.0
317,2017-12-31,21.7,2.5,11444.0,1.0

# 데이터프레임과 통계메소드

In [130]:
sunspots.describe() # 통계요약

,Yearly Mean Total Sunspot Number,Yearly Mean Standard Deviation,Number of Observations,Definitive/Provisional Indicator
count,319.000000,201.000000,201.000000,319.0
mean,78.970533,7.947761,1572.751244,1.0
std,62.019871,3.840522,2667.888556,0.0
min,0.000000,1.100000,150.000000,1.0
25%,24.800000,4.700000,365.000000,1.0
50%,65.800000,7.600000,365.000000,1.0
75%,115.750000,10.400000,366.000000,1.0
max,269.300000,19.100000,12611.000000,1.0

In [133]:
sunspots.count()     # NaN이 아닌 값의 갯수

Date                                319
Yearly Mean Total Sunspot Number    319
Yearly Mean Standard Deviation      201
Number of Observations              201
Definitive/Provisional Indicator    319
dtype: int64

In [134]:
sunspots.mad()    # mean absolute deviation, 평균 절대 편차

Yearly Mean Total Sunspot Number      50.954279
Yearly Mean Standard Deviation         3.155848
Number of Observations              1990.750773
Definitive/Provisional Indicator       0.000000
dtype: float64

In [135]:
sunspots.std()    # standard deviation, 표준편차

Yearly Mean Total Sunspot Number      62.019871
Yearly Mean Standard Deviation         3.840522
Number of Observations              2667.888556
Definitive/Provisional Indicator       0.000000
dtype: float64

In [136]:
sunspots.median()   # 중앙값, 2분위수

Yearly Mean Total Sunspot Number     65.8
Yearly Mean Standard Deviation        7.6
Number of Observations              365.0
Definitive/Provisional Indicator      1.0
dtype: float64

In [138]:
sunspots.mean()    # 평균

Yearly Mean Total Sunspot Number      78.970533
Yearly Mean Standard Deviation         7.947761
Number of Observations              1572.751244
Definitive/Provisional Indicator       1.000000
dtype: float64

In [141]:
sunspots.sum()    # 합

Date                                1700-12-311701-12-311702-12-311703-12-311704-1...
Yearly Mean Total Sunspot Number                                              25191.6
Yearly Mean Standard Deviation                                                 1597.5
Number of Observations                                                         316123
Definitive/Provisional Indicator                                                  319
dtype: object

In [142]:
sunspots.min()

Date                                1700-12-31
Yearly Mean Total Sunspot Number             0
Yearly Mean Standard Deviation             1.1
Number of Observations                     150
Definitive/Provisional Indicator             1
dtype: object

In [143]:
sunspots.max()

Date                                2018-12-31
Yearly Mean Total Sunspot Number         269.3
Yearly Mean Standard Deviation            19.1
Number of Observations                   12611
Definitive/Provisional Indicator             1
dtype: object

In [2]:
# sunspots.mode()   # 최빈값, 빈도가 가장 높은 값

In [146]:
sunspots.var()   # 분산

Yearly Mean Total Sunspot Number    3.846464e+03
Yearly Mean Standard Deviation      1.474961e+01
Number of Observations              7.117629e+06
Definitive/Provisional Indicator    0.000000e+00
dtype: float64

In [148]:
sunspots.skew()  # 비대칭도

(Yearly Mean Total Sunspot Number    0.810785
 Yearly Mean Standard Deviation      0.546692
 Number of Observations              1.972382
 Definitive/Provisional Indicator    0.000000
 dtype: float64,)

In [149]:
sunspots.kurt()  # 첨도

Yearly Mean Total Sunspot Number   -0.127610
Yearly Mean Standard Deviation     -0.252353
Number of Observations              2.728810
Definitive/Provisional Indicator    0.000000
dtype: float64

# DataFrame을 불리언 방식으로 검색

In [14]:
#sunspots['Yearly Mean Total Sunspot Number']
# sunspots[sunspots > sunspots.mean()]

In [13]:
# 불필요한 결과
# sunspots[sunspots['Number of Observations'] < 
#          sunspots['Number of Observations'].mean()]

# # 올바른 결과
# sunspots[sunspots['Number of Observations'] < 
#          sunspots['Number of Observations'].mean()]

In [156]:
sunspots.head()    # 처음 5줄
sunspots.head(3)   # 처음 3줄
sunspots.tail()    # 처음 5줄
sunspots.tail(3)   # 처음 3줄

,Date,Yearly Mean Total Sunspot Number,Yearly Mean Standard Deviation,Number of Observations,Definitive/Provisional Indicator
316,2016-12-31,39.8,3.9,9940.0,1.0
317,2017-12-31,21.7,2.5,11444.0,1.0
318,2018-12-31,7.0,1.1,12611.0,1.0

# 데이터 프레임의 데이터 추가와 합치기 
 - 행(수직)으로 합치기 : append(), concat()

In [24]:
score_table1 = {'영어점수' : [72,82,22,73,53], '수학점수' : [50,60,70,80,90]}
score_table2 = {'영어점수' : [10,20,30,40,50], '수학점수' : [20,30,40,10,30]}
df1 = pd.DataFrame(score_table1)
df2 = pd.DataFrame(score_table2)
df1
df2

# 데이터 프레임에 데이터 추가 : new_dataframe = old_dataframe1.append(old_dataframe2)

df1.append(df2)                # 공통된 열을 사용하여 행을 추가(컬럼은 똑같고 인스턴스만 다를 경우)
df1.append(df2,ignore_index=True)   
df1  # 원본 데이터는 append해도 변하지 않는다

   영어점수  수학점수
0    72    50
1    82    60
2    22    70
3    73    80
4    53    90

In [26]:
pd.concat([df1,df2],axis=0,ignore_index=True)    # ignore 쓰는 이유가 인덱스를 자연스럽게 연결하기 위해

   영어점수  수학점수
0    72    50
1    82    60
2    22    70
3    73    80
4    53    90
5    10    20
6    20    30
7    30    40
8    40    10
9    50    30

# 열로 합치기 
 - merge()
 - join()
 - concat()

In [28]:
pd.concat([df1,df2],axis=1)    # ignore_index=True 를 빼주기

   영어점수  수학점수  영어점수  수학점수
0    72    50    10    20
1    82    60    20    30
2    22    70    30    40
3    73    80    40    10
4    53    90    50    30

merge()

In [37]:
df_dest = pd.read_csv('dest.csv')
df_tips = pd.read_csv('tips.csv')
df_dest
df_tips

   EmpNr  Amount
0      5    10.0
1      9     5.0
2      7     2.5

In [41]:
# 내부조인 : 공통조건에 만족되는 부분만 조인된다
# 공통조건 = EmpNr

pd.merge(df_dest,df_tips, how = 'inner', on='EmpNr')   

# 공통된 컬럼의 결과만 보여준다
# on 은 공통 조건을 설정


# 외부조인 : 공통조건 관계 없이 모두 조인된다

pd.merge(df_dest,df_tips, how = 'outer')

   EmpNr       Dest  Amount
0      5  The Hague    10.0
1      3  Amsterdam     NaN
2      9  Rotterdam     5.0
3      7        NaN     2.5

In [43]:
# join(self, other, on, how, lsuffix, rsuffix, sort)
df_dest.join(df_tips,lsuffix='df_dest',rsuffix='df_tips')

   EmpNrdf_dest       Dest  EmpNrdf_tips  Amount
0             5  The Hague             5    10.0
1             3  Amsterdam             9     5.0
2             9  Rotterdam             7     2.5

In [80]:
employee = [{'empno':1, 'ename':'kim', 'dept':1},
            {'empno':2, 'ename':'lee', 'dept':2}, 
            {'empno':3, 'ename':'park', 'dept':1}, 
            {'empno':4, 'ename':'song', 'dept':3},
            {'empno':5, 'ename':'min', 'dept':2} ]

dept=[{'dept':1, 'deptname':'관리직'},
      {'dept':2, 'deptname':'영업직'},
      {'dept':3, 'deptname':'개발직'} ]

info =[{'empno':1, 'addr':'서울시','phone':'010-1111-1111'},
       {'empno':3, 'addr':'부산시','phone':'010-2222-2222'}, 
       {'empno':2, 'addr':'광주시','phone':'010-3333-3333'}, 
       {'empno':5, 'addr':'광주시','phone':'010-4444-4444'},
       {'empno':4, 'addr':'광주시','phone':'010-5555-5555'} ]

emp = pd.DataFrame(employee)
dept = pd.DataFrame(dept)
info = pd.DataFrame(info)

In [81]:
# 내부조인
m = pd.merge(emp,dept,how = 'inner', on='dept')
m.drop(columns = ['dept'],inplace = True)             # 'dept' 컬럼이 삭제
m
# drop(self, labels, axis, index, columns, level, inplace, errors)
m.drop(index = [1,3], inplace = True)                 # 1,3행을 삭제

In [82]:
m2 = pd.merge(m,info,how = 'inner', on='empno')
m2.drop(columns = ['empno'],inplace = True)
m2

  ename deptname addr          phone
0   kim      관리직  서울시  010-1111-1111
1   lee      영업직  광주시  010-3333-3333
2  song      개발직  광주시  010-5555-5555

# 원하는 행을 추출
 
 - contains() 메소드를 사용하여 조건을 검색, 행을 추출 _ str만 가능

 - 데이터 이름[데이터이름['칼럼명'].str.contains('원하는 단어')]

In [98]:
sr = m2['ename'].str.contains('park')
type(sr)
print(sr)
m2[1:2]
m2[sr]

print(m2[m2['deptname'].str.contains('영업직')])
print(m2[m2['addr'].str.contains('광주시')])
print(m2[m2['ename'].str.contains('k')])

0    False
1    False
2    False
Name: ename, dtype: bool
  ename deptname addr          phone
1   lee      영업직  광주시  010-3333-3333
  ename deptname addr          phone
1   lee      영업직  광주시  010-3333-3333
2  song      개발직  광주시  010-5555-5555
  ename deptname addr          phone
0   kim      관리직  서울시  010-1111-1111

series 객체의 통계 메소드

In [106]:
score_table1 = {'영어' : [72,82,22,73,53], '수학' : [50,60,70,80,90]}
df1 = pd.DataFrame(score_table1)
sr = df1['영어']
# sum,mean,median,min,max
sr.sum()
print('sum=',df1['영어'].sum())
print('mean=',df1['영어'].mean())
print('median=',df1['영어'].median())
print('min=',df1['영어'].min())
print('max=',df1['영어'].max())

sum= 302
mean= 60.4
median= 72.0
min= 22
max= 82

# 참고하기

In [5]:
# Series 객체의 index 사용 및 결측치 제어
import pandas as pd
index_table = ['tv', 'vtr', 'phone']
sr = pd.Series(['10','20','30'], index = index_table) 
sr

tv       10
vtr      20
phone    30
dtype: object

In [6]:
# Series 객체의 index 사용 및 결측치 제어

index_table = ['tv', 'vtr', 'phone']
sr = pd.Series(['10','20','30'], index = index_table) 

# Index 가 숫자가 아닌 값이 들어 갈 수 있음

sr.str.contains('10')
sr.index.str.contains('vtr') # index의 유무를 True와 False로 알 수 있다.
sr = pd.Series(['10','20'])
sr.str.contains('10')
sr.index.str.contains('vtr')

import numpy as np
data = np.array([[1,2,3],[4,5,6],
                 [7,8,9],[10,11,12]])
index_date = ['a', 2, 3, 4]
columns_list = ['A', 'B', 'C']
df = pd.DataFrame(data, index = index_date, columns = columns_list)
df.index.str.contains('a')

AttributeError: Can only use .str accessor with string values (i.e. inferred_type is 'string', 'unicode' or 'mixed')

# 누락된 데이터(결측치, NaN, NaT) 다루기

In [121]:
df = pd.read_csv('WHO_first9cols.csv')
df.columns[-2]
df[['Country',df.columns[-2]]]        # 원하는 컬럼과 원하는 컬럼 내용 
df[['Country',df.columns[-2]]][:2]   # 그 중에서 원하는 부분 슬라이싱
df2 = df[['Country',df.columns[-2]]][:2]
print(pd.isnull(df2))
print(pd.notnull(df2))

print(pd.isnull(df2).sum())
print(pd.notnull(df2).sum())
df.notnull()
df3 = df2.fillna(0)    # NaN을 0으로 수정, 결측치 수정 
df3

# median 은 중간값
# mean   은 평균값 
# 평균을 구할 때 0을 넣게 되면 오히려 줄어드다

   Country  Net primary school enrolment ratio male (%)
0    False                                         True
1    False                                        False
   Country  Net primary school enrolment ratio male (%)
0     True                                        False
1     True                                         True
Country                                        0
Net primary school enrolment ratio male (%)    1
dtype: int64
Country                                        2
Net primary school enrolment ratio male (%)    1
dtype: int64

       Country  Net primary school enrolment ratio male (%)
0  Afghanistan                                          0.0
1      Albania                                         94.0

# 결측치 
 - 결측치 부분을 메꾸는 방법
 
test['viewCount'] = test['viewCount'].fillna(test.viewCount.mean())


 - 만약 결측치가 문자열 스페이스(' ')로 되어 있다면, np.nan으로 바꾸어 Pandas 라이브러리가 인식할수 있도록 변환
 
test.viewCount = test.viewCount.replace('', np.nan)


 - 결측치를 제거하는 방법
 
test.dropna(how='all').head() # 한 행이 모두 missing value이면 제거
test.dropna(how='any').head() # 한 행에서 하나라도 missing value가 있으면 제거

날짜다루기 : pd.to_datetime(['2019-7-25'])

In [134]:
# posix 시간 표기법 :   1970년 1월 1일
pd.date_range('9/22/1677',periods = 4, freq='d')   # ok!
pd.date_range('9/21/1677',periods = 4, freq='d')   # error!

In [142]:
date1 = '2019-07-25'
date2 = '2019/07/25'
type(date1)
d1 = pd.to_datetime([date1])
d2 = pd.to_datetime([date2])
t = d2 -d1
t
# 날짜 변수로 바꾸면 계산이 가능하다. 시간과의 차이를 만든다.

TimedeltaIndex(['0 days'], dtype='timedelta64[ns]', freq=None)

# Series 객체의 index 사용 및 결측치 제어

In [8]:
import numpy as np

index_table = ['tv','vtr','phone']
sr = pd.Series([10,20,30],index = index_table)

# sr.str.contains('10')
sr.index.str.contains('vt')
sr = sr.append(pd.Series([np.nan],index=['radio']))

# sr.append(sr)
sr_mean = sr.mean()
print(sr)
print(sr.fillna(sr_mean))     # 결측치를 평균값으로 변경

tv       10.0
vtr      20.0
phone    30.0
radio     NaN
dtype: float64
tv       10.0
vtr      20.0
phone    30.0
radio    20.0
dtype: float64

In [11]:
import seaborn as sb
titanic = sb.load_dataset('titanic')
# titanic

# groupby() 함수

In [40]:
import numpy as np
from numpy.random import seed
from numpy.random import rand
from numpy.random import randint

seed(42)  # 머신러닝같이 똑같은 결과를 원할 때 rand 함수를 똑같이 고정한다.
# np.random.seed(42)


df = pd.DataFrame({ 'Weather' : ['cold', 'hot', 'cold', 'hot', 'cold', 'hot', 'cold'],
'Food' : ['soup', 'soup', 'icecream', 'chocolate', 'icecream', 'icecream', 'soup'],
'Price' : 10 * rand(7), 'Number' : randint(1, 9, 7)})
df


# np.random.rand(n)  0과 1 사이의 값을 균일분포로 난수 n개 생성
# seed 값을 고정하면 rand 값이 항상 일정하다 
# rand(7)
# np.random.randint(start, end+1, size)  # 마지막은 step이 아니라 갯수를 설정해준다.
# randint(1,9,3)  array([4,7,4])

  Weather       Food     Price  Number
0    cold       soup  3.745401       8
1     hot       soup  9.507143       5
2    cold   icecream  7.319939       4
3     hot  chocolate  5.986585       8
4    cold   icecream  1.560186       8
5     hot   icecream  1.559945       3
6    cold       soup  0.580836       6

In [51]:
weather_group = df.groupby('Weather')
weather_group   # DataFrameGroupBy object

weather_group.first()
weather_group.last()
weather_group.describe()
weather_group.mean()

i = 0
for name, group in weather_group:
    i = i+1
    print(i,name, '\n', group)
    # print(type(group))       DataFrame

1 cold
   Weather      Food     Price  Number
0    cold      soup  3.745401       8
2    cold  icecream  7.319939       4
4    cold  icecream  1.560186       8
6    cold      soup  0.580836       6
  Weather      Food     Price  Number
0    cold      soup  3.745401       8
2    cold  icecream  7.319939       4
4    cold  icecream  1.560186       8
6    cold      soup  0.580836       6
2 hot
   Weather       Food     Price  Number
1     hot       soup  9.507143       5
3     hot  chocolate  5.986585       8
5     hot   icecream  1.559945       3
  Weather       Food     Price  Number
1     hot       soup  9.507143       5
3     hot  chocolate  5.986585       8
5     hot   icecream  1.559945       3

In [56]:
wf_groupby = df.groupby(['Weather','Food'])
print(wf_groupby)         # DataFrameGroupBy
print(wf_groupby.groups)
type(wf_groupby.groups)   # dict
wf_groupby.groups

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000019DA6BEAEB8>
{('cold', 'icecream'): Int64Index([2, 4], dtype='int64'), ('cold', 'soup'): Int64Index([0, 6], dtype='int64'), ('hot', 'chocolate'): Int64Index([3], dtype='int64'), ('hot', 'icecream'): Int64Index([5], dtype='int64'), ('hot', 'soup'): Int64Index([1], dtype='int64')}

{('cold', 'icecream'): Int64Index([2, 4], dtype='int64'),
 ('cold', 'soup'): Int64Index([0, 6], dtype='int64'),
 ('hot', 'chocolate'): Int64Index([3], dtype='int64'),
 ('hot', 'icecream'): Int64Index([5], dtype='int64'),
 ('hot', 'soup'): Int64Index([1], dtype='int64')}

In [61]:
wf_groupby.agg([np.mean])
wf_groupby.agg([np.sum])

                      Price Number
                        sum    sum
Weather Food
cold    icecream   8.880126     12
        soup       4.326237     14
hot     chocolate  5.986585      8
        icecream   1.559945      3
        soup       9.507143      5

# pivot_table() 함수

In [62]:
pd.pivot_table(df,columns = ['Food'], aggfunc=np.mean)

Food    chocolate  icecream      soup
Number   8.000000  5.000000  6.333333
Price    5.986585  3.480024  4.611127

In [67]:
titanic.pivot_table('survived','pclass',aggfunc='mean')     # 상관관계를 구하는 것. 등급 클래스에 따라 생존율 확인 
# df.pivot_table('Number','Price',aggfunc='mean')           # 그렇게 의미는 없다

        survived
pclass
1       0.629630
2       0.472826
3       0.242363

In [68]:
titanic.corr()   # 상관 관계, 1에 가까울 수로 상관관계가 높다!!!
# df.corr()  모든 변수들의 상관관계 척도

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

In [1]:
# to 시퀀스 데이터. 앞의 데이터가 영향은 없지만 그게 모이면 영향이 생긴다. ex) 단어의 유추처럼 
# 따라서 많은 데이터를 넣어보는 것이 중요
# 되고 안되고 이것이 중요(합격/실패) _ 잔존/이탈

# qcut

In [ ]:
qcut(x, q, labels=None, retbins=False, precision=3, duplicates='raise')

In [ ]:
pd.qcut(titanic.fare, 3, labels=['third','second','first'])
titanic['new_class'] = pd.qcut(titanic.fare, 3, labels=['third','second','first'])
# fare == > 3등분했다.